In [1]:
import pandas as pd

In [2]:
names=pd.read_html("top5names.html")[0]

In [3]:
names1=names.rename(index=str, columns={0: "year", 1: "rank_1_female", 2: "rank_2_female", 3: "rank_3_female", 4: "rank_4_female", 5: "rank_5_female",
                                6: "rank_1_male", 7: "rank_2_male", 8: "rank_3_male", 9: "rank_4_male", 10: "rank_5_male"})

In [4]:
names2=names1.drop(names1.index[0]).drop(names1.index[1]).reset_index(drop=True)

Which years Emma is the most chosen names?

In [5]:
names2[names2['rank_1_female']=="Emma"]["year"]

0    2017
1    2016
2    2015
3    2014
9    2008
Name: year, dtype: object

In [8]:
names2.head()

,year,rank_1_female,rank_2_female,rank_3_female,rank_4_female,rank_5_female,rank_1_male,rank_2_male,rank_3_male,rank_4_male,rank_5_male
0,2017,Emma,Olivia,Ava,Isabella,Sophia,Liam,Noah,William,James,Logan
1,2016,Emma,Olivia,Ava,Sophia,Isabella,Noah,Liam,William,Mason,James
2,2015,Emma,Olivia,Sophia,Ava,Isabella,Noah,Liam,Mason,Jacob,William
3,2014,Emma,Olivia,Sophia,Isabella,Ava,Noah,Liam,Mason,Jacob,William
4,2013,Sophia,Emma,Olivia,Isabella,Ava,Noah,Jacob,Liam,Mason,William

Which name had been the most chosen name for the longest consecutive years?

How many unique male names have be on top 5 between years 1980 and 2000?

In [107]:
names_1980_2000=names2[names2['year'].astype('int')>=1980]
names_1980_2000=names_1980_2000[names_1980_2000['year'].astype('int')<=2000]
names_1980_2000
unique_names=names_1980_2000['rank_1_male']
unique_names=unique_names.append(names_1980_2000['rank_2_male']).append(names_1980_2000['rank_3_male']).append(names_1980_2000['rank_4_male']).append(names_1980_2000['rank_5_male'])
unique_names.reset_index(drop=True)
print unique_names.unique()
print len(unique_names.unique())

['Jacob' 'Michael' 'Matthew' 'Christopher' 'Jason' 'Joshua' 'David'
 'Nicholas' 'Tyler' 'Andrew' 'Daniel' 'James']
12

Are there more unique male names or more unique female names that are on top 5?

In [115]:
unique_names_male=names2['rank_1_male']
unique_names_male=unique_names_male.append(names2['rank_2_male']).append(names2['rank_3_male']).append(names2['rank_4_male']).append(names2['rank_5_male'])
unique_names_male.reset_index(drop=True)
print unique_names_male.unique()
print "Unique male names: " + str(len(unique_names_male.unique()))

unique_names_female=names2['rank_1_female']
unique_names_female=unique_names_female.append(names2['rank_2_female']).append(names2['rank_3_female']).append(names2['rank_4_female']).append(names2['rank_5_female'])
unique_names_female.reset_index(drop=True)
print unique_names_female.unique()
print "Unique female names: " + str(len(unique_names_female.unique()))

['Liam' 'Noah' 'Jacob' 'Michael' 'David' 'Robert' 'James' 'John' 'Mason'
 'Ethan' 'Matthew' 'Christopher' 'Jason' 'William' 'Joshua' 'Jayden'
 'Alexander' 'Logan' 'Daniel' 'Andrew' 'Nicholas' 'Tyler' 'Richard'
 'Charles']
Unique male names: 24
['Emma' 'Sophia' 'Isabella' 'Emily' 'Jessica' 'Ashley' 'Jennifer' 'Lisa'
 'Mary' 'Linda' 'Olivia' 'Madison' 'Hannah' 'Amanda' 'Melissa' 'Amy'
 'Michelle' 'Kimberly' 'Susan' 'Debra' 'Deborah' 'Barbara' 'Shirley'
 'Betty' 'Dorothy' 'Helen' 'Ava' 'Alexis' 'Samantha' 'Sarah' 'Brittany'
 'Heather' 'Karen' 'Patricia' 'Abigail' 'Carol' 'Judith' 'Margaret'
 'Angela' 'Donna' 'Sandra' 'Joan' 'Ruth']
Unique female names: 43

What is the distribution of the numbers of consecutive years that a male name remains the most chosen name?